<!DOCTYPE html>
<html>
<head>
	<meta charset="utf-8">
	<title></title>
	<style type="text/css">
		
	</style>
</head>
<body>
	<?php include "header.php" ?>
	<div class="main">
		<div class="container">
			<h1 class="title">СОЗДАНИЕ САЙТА</h1>
		</div>
	</div>
	<div class="textblock">
		<div class="textblock-container">
			<p class="texts">Как создать сайт бесплатно и самостоятельно с полного нуля, не имея технических знаний? Что такое «домен» и «хостинг» и зачем они нужны? Что такое «HTML-сайт», «CMS-система» и «конструктор сайтов» и в чем их ключевые отличия друг от друга?</p>
			<p class="text">Если вам близки вышеперечисленные вопросы, просим устроиться поудобнее, а мы попробуем подробно ответить на них в этой инструкции. Мы понимаем всю важность, ведь научившись создавать современные и функциональные сайты, вы сможете построить интернет-представительство не только для себя или своей компании, но и предложить подобные услуги другим заинтересованным людям. На сегодняшний день это один из наиболее перспективных и стабильных видов интернет-заработка.</p>
			<h3 class="subtitle">Технические аспекты создания сайта</h3>
			<p class="text">Технические аспекты создания собственного сайта во многом зависят от правильного выбора необходимых инструментов. Прежде всего, стоит понимать, что на сегодняшний день существует три основных способа самостоятельного создания сайта:
			с помощью конструкторов сайтов;
			помощью CMS-систем;
			путем самостоятельного написания исходного кода сайта.
			Давайте рассмотрим каждый из этих способов более подробно. Начнем с того, который, на наш взгляд лучше других подходит для новичков.</p>
			<h3 class="subtitle">Конструкторы сайтов</h3>
			<p class="text">Мы убеждены, что, если у вас ограничено время или желание разбираться, то оптимальным способом будет создание сайта в конструкторе. Мы выбрали самые эффективные и простые в использовании, что для создания сайта не потребуется каких-либо знаний в области верстки, программирования и веб-дизайна.</p>
			<p class="texts">Итак, конструктор сайта — это специализированный онлайн-сервис, включающий в себя готовые варианты графического оформления для создаваемых сайтов, а также имеющий удобный и интуитивно понятный пользовательский интерфейс.
			В идеале современный конструктор сайтов должен позволить любому человеку создать свой собственный интернет-ресурс без необходимости получения знаний в области веб-программирования и дизайна.</p>
			<p class="text">Наиболее популярные конструкторы сайтов:
			Wix – один из наиболее популярных конструкторов сайтов, который позволяет быстро и просто создавать интернет-ресурсы действительно высокого качества. UKit – конструктор, который позволяет создавать современные сайты, а затем успешно заниматься их SEO-продвижением. Он имеет простой в освоении и интуитивно понятный пользовательский интерфейс, а также включает в себя продвинутую систему аналитики.
			Nethouse – конструктор, который отлично подойдет для создания сайтов-визиток, сайтов-портфолио, интернет-магазинов. Он достаточно прост в первичном освоении и дальнейшем использовании.</p>
			<h4 class="subtitle2">Простой пример создания сайта</h4>
			<p class="text">Давайте вкратце пробежимся по этапам создания сайта в конструкторе Wix. Он отлично подойдет для деловых людей, кто не желает погружаться в тонкости создания сайтов и избавит их от необходимости делать свой первый ресурс на «голом» HTML или разбираться с особенностями работы CMS.
			Сам процесс состоит из нескольких понятных и простых шагов, о которых чуть ниже!
			<b>Шаг первый</b> – регистрация в конструкторе и вход в аккаунт.
			Проходим простую процедуру регистрации, заполнив данные формы либо просто авторизовавшись в одной из популярных соц.сетей.
			<b>Шаг второй</b> – выбираем базовый шаблон дизайна для будущего сайта.
			Конструктор предоставляет в распоряжение пользователей коллекцию из более 500 уникальных бесплатных шаблонов! Такого выбора нет нигде!
			Ваша задача будет выбрать наиболее подходящий по функционалу и визуальному оформлению шаблон, после чего можно приступать к его настройке и наполнению.</p>
			<img class="textblock__img" src="wix.jpg">
			<p class="text"><b>Шаг третий</b> – оформляем и персонализируем сайт.
			В первую очередь необходимо дать создаваемому ресурсу уникальное название. Стоит отметить, что в случае необходимости присвоенное на этом шаге название сайта можно будет изменить в любой момент.
			По умолчанию, вы получаете домен третьего уровня (вида вашлогин.wix.com/вашсайт), но вы легко можете подключить своей домен 2го уровня.</p>
			<p class="texts">Визуальный редактор с простотой MS PowerPoint, позволяет изменять любой элемент создаваемого сайта, а также без каких-либо проблем добавлять или удалять самые разнообразные блоки и модули.</p>
			<p class="text"><b>Шаг четвертый</b> – финальные штрихи и запуск.
			Просмотрите мобильную версию, убедитесь, что вас все устраивает.
			Подтвердите ранее введенные контактные данные.
			Обязательно сделайте «Предпросмотр» перед запуском сайта.
			И наконец, нажмите кнопку «Публикация», чтобы созданный вами сайт стал частью всемирной паутины и был доступен всем пользователям.</p>
			<p class="text">Конечно, создание сайта это процесс творческий и скорее всего вы будете постоянно возвращаться к нему и внедрять новые возможности и фишки. Конструктор дает возможность сконцентрироваться на самом важном и наслаждаться процессом создания.
			В результате вы получаете высококачественный сайт с удобной мобильной версией и совсем без технических знаний. Если у вас остались вопросы по конструктору, то вы сможете найти ответ на них в нашей подробной пошаговой инструкции.</p>
			<h3 class="subtitle">CMS-системы</h3>
			<p class="texts">Термин CMS происходит от английского выражения Content Management System и используется для обозначения так называемых «систем управления контентом» (сайтом).
Эти же системы зачастую называют «движками» для сайтов. На сегодняшний день любая CMS-система позволяет управлять всем содержимым сайта с помощью простого и наглядного интерфейса.</p>
			<p class="text">Вполне естественно, что выбор CMS-системы зависит от цели создания конкретного сайта. Каждый движок для сайта имеет свои особенности, преимущества и недостатки. Кроме того, стоит учитывать, что все CMS-системы делятся на две большие группы: бесплатные и платные движки.</p>
			<h4 class="subtitle2">Топ бесплатных CMS-систем</h4>
			<p class="text">WordPress – отлично подходит для создания блогов, сайтов-визиток, корпоративных сайтов. Кстати, сайт, который вы сейчас читаете, работает на базе именно этой CMS. И мы уже опубликовали руководство, в котором рассказывается о том, как создать сайт на WordPress.</p>
			<p class="text">Joomla – еще одна многофункциональная CMS-система, которая позволяет создать как простой сайт-визитку или корпоративный сайт, так и полноценный интернет-магазин. Обязательно прочитайте наше руководство, посвященное тому, как создать сайт на Joomla.</p>
			<p class="text">InstantCms – в первую очередь, этот движок предназначен для создания социальных сетей, городских порталов, а также сайтов знакомств и онлайн-клубов;</p>
			<p class="text">Drupal — ещё одна популярная CMS-система, которая отлично подходит для создания корпоративных сайтов, сайтов-визиток, а также сайтов-портфолио, социальных сетей и интернет-магазинов;</p>
			<p class="text">OpenCart –данная CMS-система предназначена, прежде всего, для создания интернет-магазинов. Вместе с тем стоит учитывать, что она проста в использовании, но при этом достаточно сложна в плане разработки. Как показывает практика, для разработки полноценного интернет-магазина на основе этого движка требуется привлечение опытного PHP-программиста.</p>
			<p class="text">phpBB – отличная CMS-система, предназначенная для создания форумов.</p>
			<h4 class="subtitle2">Топ платных CMS-систем</h4>
			<p class="text">«1С-Битрикс» — мощная и многофункциональная система управления сайтами. Она позволяет создавать и поддерживать интернет-ресурсы практически любого типа. В качестве ключевых особенностей стоит выделить простоту управления созданным сайтом, высокую производительность, интеграцию с 1С (это очень важный момент для российских интернет-магазинов), а также обширные возможности мобильного администрирования.</p>
			<p class="text">UMI.CMS – еще один достойный представитель платных CMS-систем. Девиз его разработчиков — «удобство для людей». Специально для этого движка было создано 500 уникальных шаблонов, которые подойдут практически для любого сайта и при этом предоставят возможность доработки под каждый конкретный проект. А 2500 разработчиков будут рады помочь вам в создании сайта на основе UMI.CMS и его «затачивании» именно под ваши цели.</p>
			<p class="text">платная CMS-система, предназначенная для создания современных интернет-магазинов и обладающая богатейшими функциональными возможностями.</p>
			<h3 class="subtitle">Самостоятельное создание сайта</h3>
			<h4 class="subtitle2">Создание HTML-сайта</h4>
			<p class="text">В качестве первого примера мы создадим простой HTML-сайт, который будет состоять всего из одной страницы. HTML (HyperText Markup Language — язык разметки гипертекстов) – универсальный язык, предназначенный для описания веб-страниц. Его задача заключается в том, чтобы указать браузеру, что и как нужно отображать при загрузке страницы в браузере пользователя. Каждый из его тегов описывает фрагмент страницы.
			</p>
			<h4 class="subtitle2">Ключевые этапы создания сайта</h4>
			<p class="text">Самостоятельное создание сайта с нуля состоит из трех основных этапов:</p>
<p class="text">Создание макета сайта. Именно на этом этапе появляется четкое визуальное представление, как будет выглядеть создаваемый интернет-ресурс. Чаще всего используется Adobe Photoshop или другие растровые редакторы.</p>
<p class="text">Верстка сайта. На этом этапе приступают к верстке сайта из макета .psd, мобильной адаптации и тестированию на корректное отображение в различных браузерах.</p>
<p class="text">Внедрение PHP. На этом этапе сайт превращается из статичного в динамический.</p>
<p class="text"> Давайте разберемся со всеми этими этапами более подробно.</p>
<h4 class="subtitle2">Создание макета сайта</h4>
<p class="text">Чаще всего макет (в данном случае под этим словом стоит понимать визуальное оформление) сайта создается в программах, которые принято называть графическими редакторами. Наиболее популярными являются Adobe Photoshop и CorelDRAW. Мы рекомендуем использовать именно Photoshop, так как он чуть проще в освоении и при этом обладает богатейшими возможностями. Кроме того, именно им пользуются все веб-дизайнеры.</p>
</p>
<h4 class="subtitle2">Создание сайта с помощью PHP</h4>
<p class="text">
На HTML-странице, созданной в только на HTML, все определено заранее и не будет изменяться при обращении со стороны пользователей. Такие страницы принято называть статичными, для их создания вполне хватает средств, предоставляемых языком гипертекста HTML.
</p>
<p class="text">Если же предоставляемая пользователям сайта информация изменяется в зависимости от каких-либо факторов или запросов, говорят, что веб-страница содержит динамический контент (является динамической).</p>
<p class="text">Для создания таких страниц необходимо использовать языки веб-программирования. Среди них наиболее широко распространены PHP, Python и Ruby on Rails для Unix-систем, а для Windows характерна разработка динамического контента с использованием средств .NET.</p>
<p class="text">Это все касается серверной части, а для программирования на клиентской стороне чаще всего используется JavaScript.</p>
<p class="text">В подготовленном нами архиве есть папка php, в которой сохранен файл index.php. Именно он позволяет реализовать три странички нашего тестового сайта с помощью PHP.</p>
<p class="text">PHP – это популярнейший язык веб-программирования, предназначенный для создания динамических веб-страниц. Главное отличие динамической веб-страницы от статичной заключается в том, что она формируется на сервере, а уже готовый результат передается в браузер пользователя.</p>

		</div>
	</div>
	<?php include "footer.php" ?>
</body>
</html>